app/Http/Controllers/CategoryController.php

    public function index()
    {
        $categories = Category::all();
---
select * from `categories`

    public function store(StoreBlogCategory $request) {
        $category = new Category;
        $category->label = $request->label;
        $category->save();
---
insert into `categories` (`label`) values ('qssqdqs')

    public function edit(StoreBlogCategory $request, $id) {
        $category = Category::find($id);
        $category->labelCategory = $request->label;
        $category->save();
---
update `categories` set `labelCategory` = 'Tools 2' where `idCategory` = '1'